In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [61]:
import copy
df=copy.copy(df1)

#### 1.Fill in these missing numbers and make the column an integer column (instead of a float column).

In [62]:
import math
index=0

constVal=math.nan
for x in df["FlightNumber"]:
    if np.isnan(constVal):
        if ~np.isnan(x):
            constVal=x
            break
    index+=1
    
nindex=0
for x in df["FlightNumber"]:
    if np.isnan(x):
        i=nindex-index
        df["FlightNumber"][nindex]=constVal+ i *10
    
    nindex+=1
# convert float to int 
df["FlightNumber"]=df.FlightNumber.astype(int)

<ipython-input-62-34745a2ed5c3>:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["FlightNumber"][nindex]=constVal+ i *10

In [63]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int32
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: int32(1), object(3)
memory usage: 268.0+ bytes

#### 2.Split each string on the underscore delimiter _ to give a new temporary DataFrame with
#### the correct values. Assign the correct column names to this temporary DataFrame.

In [51]:
tempDataframe = pd.DataFrame()
tempDataframe[['From', 'to']]= df['From_To'].str.split('_', 1, expand=True)

In [52]:
tempDataframe

       From         to
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

#### 3. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [53]:
def func(strVal):
    strVal=strVal.lower()
    strVal=strVal.capitalize()
    return strVal
    

for i in tempDataframe:
    tempDataframe[i]=tempDataframe[i].apply(func)
    
    
tempDataframe

       From         to
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

#### 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [64]:
df=df.drop(['From_To'],axis=1)

In [65]:
df=pd.concat([df,tempDataframe],axis=1)

In [66]:
df

   FlightNumber  RecentDelays              Airline      From         to
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [ ]:
cols=list(df.columns)

In [74]:
cols[3:5]+cols[0:3]

['From', 'to', 'FlightNumber', 'RecentDelays', 'Airline']

In [71]:
# reaaranging column
df=df[cols[3:5]+cols[0:3]]

In [72]:
df

       From         to  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

#### 5.Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [105]:
newdf=copy.copy(df)

In [106]:
newdf=newdf["RecentDelays"].apply(pd.Series).rename(columns=lambda x:'delay_'+str(x+1))

In [107]:
changeddf=pd.concat([df[:],newdf[:]],axis=1).drop(["RecentDelays"],axis=1)

In [108]:
changeddf

,From,to,FlightNumber,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN